{
  "title": "Longtime Zaslav Aide David Leavy Leaving WBD",
  "source": "Deadline",
  "url": "https://deadline.com/2025/12/david-leavy-wbd-exit-zaslav-cnn-1236652941/",
  "content": "Change is afoot at Warner Bros Discovery, on many levels.\nAs the David Zaslav-led conglomerate aims to sell off studio and streaming assets to Netflix (unless David Ellison and Larry Ellison have something to say and bid about it), one of the CEO’s longest serving and closest aides is exiting.\nFormer CNN COO David Leavy will be leaving WBD at the end of the year.\nHaving held a corporate non-operating role the past several months since shifting from his 2023 unveiled cable news gig, Leavy made his not entirely unexpected announcement Thursday in an email to colleagues.\n“When I first joined in 2000, Discovery was based in Bethesda, MD, as a small privately held cable company with a few networks and websites…but it did have really smart and dedicated people with very grand ambitions…and to witness the company’s extraordinary evolution and global growth over the past 25 years has been incredible,” Leavy wrote with a specific and “special call-out” to Zas.\nWatch on Deadline\n“That story continues to be written in real time with the next great chapter in ’26 and beyond,” the exec added. “I will be cheering loudly for the best outcomes for WBD with all the amazing stories it tells every day, and all the world-class people that work here.”\nREAD DAVID LEAVY’S FULL NOTE TO WBD STAFF BELOW\nLeavy has no immediate next act in mind. Though with his political background and corporate stints a think tank or non-profit could be in the mix, I hear.\nHaving said, the next few weeks will see Leavy, who served as chief spokesman and senior director of public affairs for the National Security Council and as deputy press secretary for foreign affairs in the Clinton White House, take some family time over the holidays and beyond, sources say.\nSpeaking of saying — off a busy week of rejecting the Ellisons and Paramount‘s $108 billion hostile takeover bid for all of WBD and showing Netflix CEOs Ted Sarandos and Greg Peters around the lot that may soon(ish) become their home away from home, David Zaslav had some nice words today for his soon-to-be former right hand man and protégé.\n“David had a terrific 25 year run at Discovery and WBD,” the senior David said of the David who was Discovery’s chief corporate affairs officer and came over to the new WBD with his boss with the 2022 merger. “David is both a great person and an outstanding executive, and I’m confident this is the right moment for him to take the next step in his career and life. Wherever he goes, he will bring leadership, strategic drive and just a collaborative spirit that always leads to good things happening.”\nHere is David Leavy’s full email to his Warner Bros Discovery colleagues:\nFolks….I want to let you know that I will be leaving WBD at the end of the year. As the company goes through its next iteration of structure and strategy, and after 25 years at this wonderful organization, it feels like the right time to do the same.\nIt has truly been an honor to work for Discovery and WBD alongside smart, kind and driven colleagues – I feel incredibly lucky to have shared that journey with so many of you….and you are a big part of what has made it so meaningful. Thank you for being part of this amazing company. I leave filled with immense gratitude, pride and joy.\nA special call-out to David Zaslav…it has been a great privilege to work with Zas and just a big thank-you to him for all the opportunities, guidance, encouragement and support for so many years.\nWhen I first joined in 2000, Discovery was based in Bethesda, MD, as a small privately held cable company with a few networks and websites…but it did have really smart and dedicated people with very grand ambitions…and to witness the company’s extraordinary evolution and global growth over the past 25 years has been incredible. That story continues to be written in real time with the next great chapter in ’26 and beyond. I will be cheering loudly for the best outcomes for WBD with all the amazing stories it tells every day, and all the world-class people that work here.\nThanks again for everything…travel safe and may God bless you and your families during this holiday season…Merry Christmas and happy holidays.\nTalk soon…Best, David",
  "published_at": "2025-12-18"
}