{
  "title": "Mandy Moore to Star in Erotic Thriller 'Teach Me' for Peacock and A24",
  "source": "Variety",
  "url": "https://variety.com/2025/tv/news/mandy-moore-teach-me-erotic-thriller-peacock-a24-1236601287/",
  "published_at": "2025-12-05T19:00:00Z",
  "content": "Mandy Moore is set to lead an erotic thriller series currently in development at Peacock, Variety has learned.\n\nMoore is attached to star in the drama Teach Me, which is said to be about a teacher wielding power over an impressionable but unreliable student, and what happens when that student becomes the teacher, per the official logline. A fun, twisted cat-and-mouse game that explores the blurred lines between sex, power and addiction.\n\nLisa Rubin is the writer and executive producer, with Moore executive producing in addition to starring. Jessica Rhoades and Alison Mo Massey of Pacesetter also executie produce. Universal Television and A24 will produce.\n\nThe role would bring Moore back into the NBCU fold, as she previously starred in the popular NBC series This Is Us for six seasons. For her work on the show, she was nominated for both an Emmy Award and a Golden Globe. She also appeared in the second season of the Peacock series Dr. Death in 2023. Moore will next star in a pro football drama series at Hulu that hails from This Is Us creator Dan Fogelman, with that show currently in production. In film, Moore is known for her work in features like Tangled, Midway, The Darkest Minds, 47 Meters Down, Saved, and A Walk to Remember.\n\nRubin previously created the Netflix series Gypsy starring Naomi Watts, Billy Crudup and Lucy Boynton. She has also written scripts for film adaptations such as Under the Influence and The Wife Upstairs. She recently penned a Janis Joplin film that will be directed by James Ponsoldt and stars Shailene Woodley.\n\nIn addition to Teach Me, Pacesetter is behind the upcoming Peacock espionage drama Ponies starring Emilia Clarke and Haley Lu Richardson. Other upcoming projects include a new Charlie Brooker series and also a limited series Josh Hartnett, both at Netflix. Past productions include Sharp Objects, Utopia, and Dirty John Season 2.\n\nMoore is repped by Gersh, Untitled Entertainment and Johnson Shapiro Slewett & Kole. Rubin is repped by UTA and Hansen Jacobson. Pacesetter is repped by UTA, and attorney Adam G. Cooper at Jackaway Austen Tyerman."
}