{
  "title": "WGA Opposes Netflix-Warner Bros. Deal: This Merger Must Be Blocked",
  "source": "Variety",
  "url": "https://variety.com/2025/film/news/wga-opposes-netflix-warner-bros-deal-merger-must-be-blocked-1236601433/",
  "published_at": "2025-12-05T18:37:00Z",
  "content": "The Writers Guild of America has joined other industry groups in coming out against Netflixs proposed blockbuster deal to acquire Warner Bros. Discoverys studios and streaming business.\n\nThe WGA warned that the $83 billion Netflix-WB deal would eliminate jobs, reduce wages and raise prices for consumers.\n\nThe worlds largest streaming company swallowing one of its biggest competitors is what antitrust laws were designed to prevent, the guild said in a statement. The outcome would eliminate jobs, push down wages, worsen conditions for all entertainment workers, raise prices for consumers, and reduce the volume and diversity of content for all viewers. Industry workers along with the public are already impacted by only a few powerful companies maintaining tight control over what consumers can watch on television, on streaming, and in theaters. This merger must be blocked.\n\nThe WGA has a consistent track record of opposition to media consolidation, arguing that it shrinks the market for writers work. After WBD commenced a review process to field M&A offers in October, the union said that combining Warner Bros. with Paramount or another major studio or streamer would be a disaster for writers, for consumers and for competition.\n\nThe WGA opposed the Comcast-NBCUniversal deal in 2011; the AT&T-Time Warner deal in 2016; the Disney-Fox merger in 2017; the Amazon-MGM merger in 2021; and the Warner Bros.-Discovery merger in 2022. The union also warned in 2023 that Disney, Netflix and Amazon were poised to become the new gatekeepers of the industry.\n\nThe Hollywood division of the Teamsters union also raised alarms, saying that the merger will kill jobs and raise prices for consumers.\n\nTeamsters have been clear on our position that greed-fueled consolidation of corporate power, no matter what industry, is a direct threat to good union jobs, the livelihood of our members and the very existence of our industry, said Lindsay Dougherty, the principal officer of Local 399. Teamsters will continue to challenge and call for the opposition across all levels of government and that antitrust enforcers reject this deal and any other deal seeking the consolidation of power and market.\n\nOther Hollywood industry groups have also expressed fears that Netflixs takeover of Warner Bros. will harm the movie theater biz given Netflixs well-known antipathy toward theatrical releases, in favor of putting all of its original movies straight to streaming with only a few exceptions.\n\nThe Producers Guild of America (PGA) said in a statement Friday: Producers are rightfully concerned about Netflixs intended acquisition of one our industrys most storied and meaningful studios. For the last century, the entertainment industry has employed millions of Americans, delighted audiences, and showcased the very best of our nation at home and abroad.\n\nThe PGA continued, As we navigate dynamic times of economic and technological change, our industry, together with policymakers, must find a way forward that protects producers livelihoods and real theatrical distribution, and that fosters creativity, promotes opportunities for workers and artists, empowers consumers with choices, and upholds freedom of speech. This is the test that the Netflix deal must pass. Our legacy studios are more than content libraries within their vaults are the character and culture of our nation.\n\nOn Thursday evening, following news that Netflix had won exclusive rights to negotiate a deal with WBD, the Directors Guild of America said the proposed pact raises significant concerns.\n\nWe believe that a vibrant, competitive industry one that fosters creativity and encourages genuine competition for talent is essential to safeguarding the careers and creative rights of directors and their teams, the guild said. We will be meeting with Netflix to outline our concerns and better understand their vision for the future of the company. While we undertake this due diligence we will not be commenting further.\n\nSAG-AFTRA likewise expressed its concerns, but stopped short of outright opposition to the deal.\n\nThe potential Netflix/Warner Bros transaction is a consolidation that may serve the financial interests of shareholders of both companies, but which raises many serious questions about its impact on the future of the entertainment industry, and especially the human creative talent whose livelihoods and careers depend on it, a SAG-AFTRA spokesperson said in a statement. This $82B transaction reaffirms the true value of legacy media companies and the long term economic prosperity they create due in large part to the contribution of the creative talent who are at the core of their success. A deal that is in the interest of SAG-AFTRA members and all other workers in the entertainment industry must result in more creation and more production, not less. It must do so in an environment of respect for the talent involved. Any decision about SAG-AFTRAs position on this transaction will be made with the best interests of SAG-AFTRA members as the standard and following a complete and thorough analysis of the details of the deal, with particular focus on jobs and production commitments.\n\nAnd Cinema United, the theater industry trade group previously known as the National Association of Theater Owners, called Netflixs takeover of Warner Bros. an unprecedented threat to the business.\n\nThe proposed acquisition of Warner Bros. by Netflix poses an unprecedented threat to the global exhibition business, Michael OLeary, CEO of Cinema United, said in a statement released late Thursday. The negative impact of this acquisition will impact theatres from the biggest circuits to one-screen independents in small towns in the United States and around the world.\n\nOLeary added, Cinema United stands ready to support industry changes that lead to increased movie production and give consumers more opportunities to enjoy a day at the local theatre. But Netflixs stated business model does not support theatrical exhibition. In fact, it is the opposite. Regulators must look closely at the specifics of this proposed transaction and understand the negative impact it will have on consumers, exhibition and the entertainment industry.\n\nNetflix, in announcing the deal Friday, said it plans to maintain Warner Bros. current operations, including continuing to release WB films in theaters. Netflix also indicated it will keep HBO Max as a discrete service, at least in the near term.\n\nThat said, Netflix co-CEO Ted Sarandos told analysts he believes release windows for Warner Bros. movies in theaters will become much more consumer friendly.\n\nI wouldnt look at this as a change in approach for Netflix movies or for Warner movies, Sarandos said. I think, over time, the windows will evolve to be much more consumer friendly, to be able to meet the audience where they are quicker. He added that our primary goal is to bring first-run movies to our members, because thats what theyre looking for."
}